
//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {


    public static void main(String[] args) {
 /* №2 Каждый следующий элемент ряда Фибоначчи получается при сложении двух предыдущих.
     Начиная с 1 и 2, первые 10 элементов будут:

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают четыре миллиона.*/
      /*  int a = 1;
        int b = 2;
        int sum = 0;

        while (b <= 4000000) {
            if (b % 2 == 0) {
                sum += b;
            }
            int next = a + b;
            a = b;
            b = next;
        }
        System.out.println(sum);*/
        /* *********************************************************************************/


// №3 найбільший цілий дільник
        /*long k = 600851475143L;
        long i = 2;
        long largestFactor = 0;

        while (k > 1) {
            if (k % i == 0) {
                k /= i;
                largestFactor = i;
            } else {
                i++;
            }
        }
        System.out.println(largestFactor);*/
        /*   ************************************************************************************/
        /* №4 Число-палиндром с обеих сторон (справа налево и слева направо) читается одинаково.
        Самое большое число-палиндром, полученное умножением двух двузначных чисел – 9009 = 91 × 99.

Найдите самый большой палиндром, полученный умножением двух трехзначных чисел.*/
       /* int mult;
        int max = 0;
        int polynd;
        int fc;
        int mnog1 = 0;
        int mnog2 = 0;
        for (int a = 100; a < 1000; a++) {
            for (int b = 100; b < 1000; b++) {
                mult = a * b;
                polynd = mult;
                int count = 0;
                while (polynd > 0) {
                    fc = polynd % 10;
                    count = (count * 10) + fc;
                    polynd /= 10;
                }
                if (mult == count && mult > max) {
                    max = mult;
                    mnog1 = a;
                    mnog2 = b;
                }
            }
        }
        System.out.println("Найбільший поліндром - " + max + ", це добуток "
                + mnog1 + " та " + mnog2);*/
        /* ************************************************************************ */
        /*2520 - самое маленькое число, которое делится без остатка на все числа от 1 до 10.

Какое самое маленькое число делится нацело на все числа от 1 до 20? відповідь - 232792560 */
     /*   int dil = 20;
        int count = 0;
        int result = 0;
        boolean d = true;
        while (d) {
            for (int i = 2; i <= 20; i++) {
                if (dil % i == 0)
                {
                    count++;
                } else
                {
                    break;
                }
            }
            if (count == 19)
            {
                result = dil;
                d = false;
            }
            dil++;
            count = 0;
        }
        System.out.println(result);
***********************************************************************************************************/
     /* №6  Сумма квадратов первых десяти натуральных чисел равна

        12 + 22 + ... + 102 = 385
        Квадрат суммы первых десяти натуральных чисел равен

                (1 + 2 + ... + 10)2 = 552 = 3025
        Следовательно, разность между суммой квадратов и квадратом суммы первых десяти натуральных чисел составляет 3025 − 385 = 2640.

        Найдите разность между суммой квадратов и квадратом суммы первых ста натуральных чисел. Ответ - 25164150 */

       /* int sk = 0;
        int ks = 0;
        for (int i = 1; i <= 100; i++) {
            sk = sk + (i * i);
            ks = ks + i;
        }
        System.out.println((ks * ks) - sk);
        *******************************************************************************************************/

        /* № 7 Выписав первые шесть простых чисел, получим 2, 3, 5, 7, 11 и 13. Очевидно, что 6-е простое число - 13.

Какое число является 10001-м простым числом?*/
     /*   int count = 1;  // Першим простим числом вважаємо 2
        int b = 1;      // Почнемо перевірку з 1 (бо будемо збільшувати на 2)
        int rez = 0;

        while (count < 10001) {
            b += 2;  // Перевіряємо тільки непарні числа
            if (isPrime(b)) {
                count++;
                rez = b;
            }
        }

        System.out.println(rez);
    }

    // Функція перевірки на простоту***
    public static boolean isPrime(int num) {
        if (num < 2) return false;
        if (num % 2 == 0 && num != 2) return false;
        for (int i = 3; i * i <= num; i += 2) {
            if (num % i == 0) return false;
        }
        return true;
        */
       /* №8 Наибольшее произведение четырех последовательных цифр в нижеприведенном 1000-значном числе равно 9 × 9 × 8 × 9 = 5832.

        73167176531330624919225119674426574742355349194934
        96983520312774506326239578318016984801869478851843
        85861560789112949495459501737958331952853208805511
        12540698747158523863050715693290963295227443043557
        66896648950445244523161731856403098711121722383113
        62229893423380308135336276614282806444486645238749
        30358907296290491560440772390713810515859307960866
        70172427121883998797908792274921901699720888093776
        65727333001053367881220235421809751254540594752243
        52584907711670556013604839586446706324415722155397
        53697817977846174064955149290862569321978468622482
        83972241375657056057490261407972968652414535100474
        82166370484403199890008895243450658541227588666881
        16427171479924442928230863465674813919123162824586
        17866458359124566529476545682848912883142607690042
        24219022671055626321111109370544217506941658960408
        07198403850962455444362981230987879927244284909188
        84580156166097919133875499200524063689912560717606
        05886116467109405077541002256983155200055935729725
        71636269561882670428252483600823257530420752963450

        Найдите наибольшее произведение тринадцати последовательных цифр в данном числе.
        23514624000*/


                String ebobo =
                        "73167176531330624919225119674426574742355349194934" +
                                "96983520312774506326239578318016984801869478851843" +
                                "85861560789112949495459501737958331952853208805511" +
                                "12540698747158523863050715693290963295227443043557" +
                                "66896648950445244523161731856403098711121722383113" +
                                "62229893423380308135336276614282806444486645238749" +
                                "30358907296290491560440772390713810515859307960866" +
                                "70172427121883998797908792274921901699720888093776" +
                                "65727333001053367881220235421809751254540594752243" +
                                "52584907711670556013604839586446706324415722155397" +
                                "53697817977846174064955149290862569321978468622482" +
                                "83972241375657056057490261407972968652414535100474" +
                                "82166370484403199890008895243450658541227588666881" +
                                "16427171479924442928230863465674813919123162824586" +
                                "17866458359124566529476545682848912883142607690042" +
                                "24219022671055626321111109370544217506941658960408" +
                                "07198403850962455444362981230987879927244284909188" +
                                "84580156166097919133875499200524063689912560717606" +
                                "05886116467109405077541002256983155200055935729725" +
                                "71636269561882670428252483600823257530420752963450";

                char[] mas = ebobo.toCharArray();
                int[] num = new int[mas.length]; // створюємо числовий масив

                for (int i = 0; i < ebobo.length(); i++) {
                    num[i] = Character.getNumericValue(mas[i]); // переводимо символи в int
                }

                long max = 0;
                for (int i = 0; i <= ebobo.length() - 13; i++) { // шукаємо серед 13 послідовних чисел
                    long c = 1; // ініціалізуємо добуток
                    for (int j = 0; j < 13; j++) {
                        c *= num[i + j]; // перемножуємо 13 чисел
                    }
                    if (c > max) {
                        max = c;
                    }
                }

                System.out.println(max);
            }
        }